# Hypothesis Testing

Relationship between variables based on their types

In [16]:
import warnings
warnings.filterwarnings('ignore')

## Numerical & Categorical

Numerical differences on groups of 1 categorical variable.

For example, which city (categorical) earns more money (numerical) per person?

In [4]:
import pandas as pd

df_salaries2 = pd.read_csv('salaries2.csv')
df_salaries2

         city  yearly_salary_k
0      Madrid               26
1      Madrid               24
..        ...              ...
38  Barcelona               17
39  Barcelona               24

[40 rows x 2 columns]

### T-test: 1 Categorical with 2 Groups

#### Summarise the data
- Calculate the mean by city

#### Visualize the data

#### Validate your hypothesis statistcally

### ANOVA: 1 Categorical with > 2 Groups

Now we go off to Bilbao and gather more data about people's salary:

In [30]:
df_salaries3 = pd.read_csv('salaries3.csv')
df_salaries3

      city  yearly_salary_k
0   Madrid               26
1   Madrid               24
..     ...              ...
58  Bilbao               26
59  Bilbao               26

[60 rows x 2 columns]

#### Summarise the data

- Calculate mean and variance by city

#### Visualize the distribution with a boxplot

#### Validate your hypothesis statistically

## Chi2: Categorical & Categorical

In [3]:
import seaborn as sns

df_titanic = sns.load_dataset('titanic')[['class', 'alive']]
df_titanic

     class alive
0    Third    no
1    First   yes
..     ...   ...
889  First   yes
890  Third    no

[891 rows x 2 columns]

### Summarise the data

### Visualize the data

### Validate your hypothesis statistically

## Pearson's Correlation: Numerical & Numerical

### Summarise the data

### Visualize the data

### Validate your hypothesis statistically